# DirectionOrigin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricArea..::..DirectionOrigin Property
FabricArea Class See Also
---
The Origin Point of the Major Direction of the Fabric Area.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public XYZ DirectionOrigin { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DirectionOrigin As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ DirectionOrigin {
	XYZ^ get ();
}
```

# See Also
FabricArea Class
Autodesk.Revit.DB.Structure Namespace